
zsh-users/zsh-completions
zsh-users/zsh-history-substring-search
zdharma-continuum/fast-syntax-highlighting
marlonrichert/zsh-autocomplete
zsh-users/zsh-autosuggestions

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/macos