# frozen_string_literal: true

# =============================================================================
# TAPS - Third-party repositories
# =============================================================================

tap 'buo/cask-upgrade'
tap 'nanovms/ops'
tap 'withgraphite/tap'
tap 'metalbear-co/mirrord'
tap 'hashicorp/tap'
tap 'bufbuild/buf'
tap 'radiosilence/dotfiles', 'https://github.com/radiosilence/dotfiles.git'
tap 'radiosilence/nano-web', 'https://github.com/radiosilence/nano-web.git'
tap 'tursodatabase/tap'

# =============================================================================
# BREW PACKAGES
# =============================================================================

# -----------------------------------------------------------------------------
# Development Tools & Languages
# -----------------------------------------------------------------------------

brew 'node'
brew 'go-task'
brew 'mise'
brew 'uv'
brew 'luarocks'
brew 'cmake'
brew 'make'
brew 'llvm'
brew 'clang-format'

# -----------------------------------------------------------------------------
# Language Servers & Development Support
# -----------------------------------------------------------------------------

brew 'ansible-language-server'
brew 'elixir-ls'
brew 'lua-language-server'
brew 'rust-analyzer'
brew 'ruby-lsp'
brew 'solargraph'
brew 'terraform-ls'
brew 'vscode-langservers-extracted'
brew 'yaml-language-server'

# -----------------------------------------------------------------------------
# Infrastructure & DevOps
# -----------------------------------------------------------------------------

brew 'ansible'
brew 'ansible-lint'
brew 'argocd'
brew 'awscli'
brew 'aws-shell'
brew 'aws-sso-util'
brew 'aws-vault'
brew 'azure-cli'
brew 'cf-terraforming'
brew 'hashicorp/tap/terraform'
brew 'k9s'
brew 'kubecolor'
brew 'kubernetes-cli'
brew 'pulumi'
brew 'tilt'
brew 'watchman'

# -----------------------------------------------------------------------------
# Networking & System Tools
# -----------------------------------------------------------------------------

brew 'curl'
brew 'wget'
brew 'nmap'
brew 'iperf3'
brew 'telnet'
brew 'unbound'
brew 'fswatch'
brew 'parallel'
brew 'rsync'
brew 'rclone'
brew 'syncthing'

# -----------------------------------------------------------------------------
# Command Line Utilities
# -----------------------------------------------------------------------------

brew 'bat'
brew 'broot'
brew 'coreutils'
brew 'fastfetch'
brew 'fcp'
brew 'findutils'
brew 'fish'
brew 'fzf'
brew 'htop'
brew 'btop'
brew 'hyperfine'
brew 'jq'
brew 'lsd'
brew 'lsix'
brew 'macchina'
brew 'mas'
brew 'ripgrep'
brew 'sheldon'
brew 'shfmt'
brew 'shellcheck'
brew 'starship'
brew 'tree'
brew 'yq'
brew 'zoxide'
brew 'zsh'

# -----------------------------------------------------------------------------
# Git & Version Control
# -----------------------------------------------------------------------------

brew 'git'
brew 'git-lfs'
brew 'gh'
brew 'tig'
brew 'lefthook'

# -----------------------------------------------------------------------------
# Media & Audio/Video Processing
# -----------------------------------------------------------------------------

brew 'ffmpeg'
brew 'flac'
brew 'sox'
brew 'libsndfile'
brew 'atomicparsley'
brew 'cmus'
brew 'yt-dlp'
brew 'ttfautohint'

# -----------------------------------------------------------------------------
# Database & Data Tools
# -----------------------------------------------------------------------------

brew 'postgresql'
brew 'libpq'
brew 'tursodatabase/tap/turso'

# -----------------------------------------------------------------------------
# Security & Cryptography
# -----------------------------------------------------------------------------

brew 'gnupg'
brew 'openssl@3'

# -----------------------------------------------------------------------------
# System Libraries & Dependencies
# -----------------------------------------------------------------------------

brew 'gmp'
brew 'libyaml'
brew 'ossp-uuid'
brew 'readline'
brew 'xz'

# -----------------------------------------------------------------------------
# API & Protocol Tools
# -----------------------------------------------------------------------------

brew 'bufbuild/buf/buf'
brew 'evans'
brew 'grpcurl'
brew 'jsonnet'
brew 'taplo'

# -----------------------------------------------------------------------------
# Specialized Tools
# -----------------------------------------------------------------------------

brew 'aria2'
brew 'cmatrix'
brew 'ios-deploy'
brew 'metalbear-co/mirrord/mirrord'
brew 'nano-web'
brew 'fastmail-cli'
brew 'nanovms/ops/ops'
brew 'qemu'
brew 'testdisk'
brew 'tmux'
brew 'tpm'
brew 'vercel-cli'
brew 'whalebrew'
brew 'withgraphite/tap/graphite'
brew 'wrk'
brew 'helix'
brew 'golangci-lint'

# =============================================================================
# CASK APPLICATIONS
# =============================================================================

cask_args require_sha: true

# -----------------------------------------------------------------------------
# Productivity & Office
# -----------------------------------------------------------------------------

cask 'notion', greedy: true
cask 'notion-calendar', greedy: true
cask '1password', greedy: true
cask '1password-cli', greedy: true

# -----------------------------------------------------------------------------
# Development & Design
# -----------------------------------------------------------------------------

cask 'zed', greedy: true
cask 'zed@preview', greedy: true
cask 'figma', greedy: true
cask 'fork', greedy: true
cask 'beekeeper-studio', greedy: true
cask 'lens', greedy: true
cask 'pgadmin4', greedy: true

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------

cask 'discord', greedy: true
cask 'signal', greedy: true

# -----------------------------------------------------------------------------
# Web Browsers
# -----------------------------------------------------------------------------

cask 'firefox', greedy: true
cask 'arc', greedy: true
cask 'zen', greedy: true

# -----------------------------------------------------------------------------
# Media & Entertainment
# -----------------------------------------------------------------------------

cask 'foobar2000', greedy: true
cask 'stolendata-mpv', args: { no_quarantine: true }, greedy: true
cask 'xld', args: { no_quarantine: true }, greedy: true

# -----------------------------------------------------------------------------
# System & Utilities
# -----------------------------------------------------------------------------

cask 'ghostty', greedy: true
cask 'orbstack', greedy: true
cask 'rar', args: { no_quarantine: true }, greedy: true
cask 'tailscale', greedy: true
cask 'aws-vpn-client', greedy: true

# -----------------------------------------------------------------------------
# Audio Production
# -----------------------------------------------------------------------------

cask 'focusrite-control', greedy: true

# -----------------------------------------------------------------------------
# AI & Productivity
# -----------------------------------------------------------------------------

cask 'claude', greedy: true

# =============================================================================
# MAC APP STORE APPLICATIONS
# =============================================================================

mas '1Password for Safari', id: 1_569_813_296
mas 'Adobe Lightroom', id: 1_451_544_217
mas 'Infuse', id: 1_136_220_934
mas 'Slack', id: 803_453_959
mas 'Telegram', id: 747_648_890
mas 'WhatsApp', id: 310_633_997
brew 'exiftool'
cask 'steam'
brew 'mdless'
brew 'swiftformat'
brew 'zsh'
