tap "buo/cask-upgrade"
tap "nanovms/ops"
tap "withgraphite/tap"
tap "metalbear-co/mirrord"
tap "hashicorp/tap"
tap "radiosilence/dotfiles", "https://github.com/radiosilence/dotfiles.git"
brew "ansible"
brew "go-task"
brew "ansible-language-server"
brew "ansible-lint"
brew "argocd"
brew "aria2"
brew "aws-shell"
brew "aws-sso-util"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "broot"
brew "clang-format"
brew "cf-terraforming"
brew "cmake"
brew "cmatrix"
brew "cmus"
brew "coreutils"
brew "curl"
brew "metalbear-co/mirrord/mirrord"
brew "elixir-ls"
brew "evans"
brew "fastfetch"
brew "fcp"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "gh"
brew "grpcurl"
brew "git"
brew "git-lfs"
brew "gmp"
brew "gnupg"
brew "terraform"
brew "terraform-ls"
brew "helix"
brew "htop"
brew "hyperfine"
brew "ios-deploy"
brew "iperf3"
brew "jsonnet"
brew "k9s"
brew "kubecolor"
brew "kubernetes-cli"
brew "libpq"
brew "libyaml"
brew "llvm"
brew "lsd"
brew "lsix"
brew "luarocks"
brew "macchina"
brew "make"
brew "mas"
brew "mise"
brew "nanovms/ops/ops"
brew "nmap"
brew "node"
brew "openssl@3"
brew "ossp-uuid"
brew "parallel"
brew "postgresql"
brew "pulumi"
brew "qemu"
brew "rclone"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "sheldon"
brew "shfmt"
brew "shellcheck"
brew "starship"
brew "syncthing"
brew "taplo"
brew "telnet"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "testdisk"
brew "tig"
brew "tilt"
brew "tmux"
brew "tpm"
brew "tree"
brew "ttfautohint"
brew "unbound"
brew "vercel-cli"
brew "vscode-langservers-extracted"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "withgraphite/tap/graphite"
brew "wrk"
brew "xz"
brew "yaml-language-server"
brew "zoxide"
brew "zsh"

cask_args require_sha: true

cask "1password", greedy: true
cask "1password-cli", greedy: true
cask "discord", greedy: true
cask "beekeeper-studio", greedy: true
cask "figma", greedy: true
cask "firefox", greedy: true
cask "focusrite-control", greedy: true
cask "foobar2000", greedy: true
cask "fork", greedy: true
cask "ghostty", greedy: true
cask "lens", greedy: true
cask "notion", greedy: true
cask "notion-calendar", greedy: true
cask "orbstack", greedy: true
cask "rar", args: { no_quarantine: true }, greedy: true
cask "stolendata-mpv", args: { no_quarantine: true }, greedy: true
cask "zed", greedy: true
cask "zed@preview", greedy: true
cask "zen", greedy: true

mas "1Password for Safari", id: 1569813296
mas "Adobe Lightroom", id: 1451544217
mas "Infuse", id: 1136220934
mas "Messenger", id: 1480068668
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997

# Added by go-brew-search on 2025-05-26 17:32:35
brew "golangci-lint" # Fast linters runner for Go

# Added by go-brew-search on 2025-05-26 23:12:15
brew "btop" # Resource monitor. C++ version and continuation of bashtop an...

# Added by go-brew-search on 2025-05-27 19:49:49
brew "lefthook" # Fast and powerful Git hooks manager for any type of projects

brew "uv"

# Added by go-brew-search on 2025-06-02 11:33:40
cask "claude" # Anthropic's official Claude AI desktop app, greedy: true
tap "radiosilence/nano-web", "https://github.com/radiosilence/nano-web.git"
brew "nano-web"
brew "fastmail-cli"
