tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "facebook/fb"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "nanovms/ops"
tap "nanovms/qemu"
tap "withgraphite/tap"
tap "buo/cask-upgrade"
brew "aria2"
brew "bat"
brew "broot"
brew "btop"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "curl"
brew "aria2"
brew "efm-langserver"
brew "fcp"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gmp"
brew "gnupg"
brew "helix"
brew "htop"
brew "jq"
brew "libyaml"
brew "lsd"
brew "make"
brew "mas"
brew "mise"
brew "mosh"
brew "nmap"
brew "node"
brew "openssl@3"
brew "pulumi"
brew "qemu"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "rclone"
brew "sheldon"
brew "starship"
brew "taplo"
brew "telnet"
brew "terraform"
brew "terraform-ls"
brew "testdisk"
brew "tig"
brew "tmux"
brew "tree"
brew "tpm"
brew "unbound"
brew "watchman"
brew "wget"
brew "withgraphite/tap/graphite"
brew "wrk"
brew "yq"
brew "xz"
brew "zoxide"
cask "1password-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "alacritty"
cask "android-studio"
cask "cog"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "mullvadvpn"
cask "postman"
cask "rar"
cask "slack"
cask "stolendata-mpv"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
mas "WhatsApp Messenger", id: 310633997
mas "Messenger", id: 1480068668
mas "Telegram", id: 747648890
mas "Slack for Desktop", id: 803453959
mas "Xcode", id: 497799835
vscode "ahmadalli.vscode-nginx-conf"
vscode "albert.tabout"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "austenc.tailwind-docs"
vscode "bierner.folder-source-actions"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "brunnerh.insert-unicode"
vscode "csstools.postcss"
vscode "dae.vscode-mac-color-picker"
vscode "dbaeumer.vscode-eslint"
vscode "dramforever.vscode-ghc-simple"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fallenwood.viml"
vscode "flowtype.flow-for-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "jianbingfang.dupchecker"
vscode "justusadam.language-haskell"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koichisasada.vscode-rdbg"
vscode "lunuan.kubernetes-templates"
vscode "m4ns0ur.base64"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "mikestead.dotenv"
vscode "mohsen1.react-javascript-to-typescript-transform-vscode"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "nanovms.ops"
vscode "naumovs.color-highlight"
vscode "netcorext.uuid-generator"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "oven.bun-vscode"
vscode "patrick91.python-dependencies-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pgourlain.erlang"
vscode "raynigon.nginx-formatter"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "royalmist.vscode-eex-format"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "serayuzgur.crates"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "sourcery.sourcery"
vscode "sumneko.lua"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vknabel.vscode-swiftformat"
vscode "vmware.vscode-concourse"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "william-voyek.vscode-nginx"
vscode "windmilleng.vscode-go-autotest"
vscode "wmaurer.change-case"
vscode "xaver.clang-format"
vscode "yatki.vscode-surround"
vscode "zhouronghui.propertylist"
